<a href="https://colab.research.google.com/github/rajkumar1234-yeddu/DA-series-and-dataframe-examples/blob/main/4thlab_9_12.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
#1
data1 = [12, 42, 34, 68]
series1 = pd.Series(data1)
print(series1)
data2 = [59 ,82, 95, 72]
series2 = pd.Series(data2)
print(series2)

0    12
1    42
2    34
3    68
dtype: int64
0    59
1    82
2    95
3    72
dtype: int64

In [ ]:
#2
series1.tolist()

[12, 42, 34, 68]

In [ ]:
#3
series3 = series1.add(series2)
print("Add Series:\n",series3)
series4 = series1.subtract(series2)
print("Subtract Series:\n",series4)
series5 = series1.mul(series2)
print("Multiply Series:\n",series5)
series6 = series1.div(series2)
print("Multiply Series:\n",series6)

Add Series:
 0     71
1    124
2    129
3    140
dtype: int64
Subtract Series:
 0   -47
1   -40
2   -61
3    -4
dtype: int64
Multiply Series:
 0     708
1    3444
2    3230
3    4896
dtype: int64
Multiply Series:
 0    0.203390
1    0.512195
2    0.357895
3    0.944444
dtype: float64

In [ ]:
#4
d1 = ['asDfg', 'hJkl', 'Qwerty', 'zxcvbNm']
seri1 = pd.Series(d1)
print(seri1)
print(seri1.str.upper())
print(seri1.str.len())
print(seri1.str.lower())

0      asDfg
1       hJkl
2     Qwerty
3    zxcvbNm
dtype: object
0      ASDFG
1       HJKL
2     QWERTY
3    ZXCVBNM
dtype: object
0    5
1    4
2    6
3    7
dtype: int64
0      asdfg
1       hjkl
2     qwerty
3    zxcvbnm
dtype: object

In [ ]:
#5
d2 = ['   asDfg', 'hJkl   ', '  Qwerty  ', 'zxcvbNm']
seri2 = pd.Series(d2)
print(seri2)

print(seri2.str.strip())
print(seri2.str.lstrip())
print(seri2.str.rstrip())

0         asDfg
1       hJkl
2      Qwerty
3       zxcvbNm
dtype: object
0      asDfg
1       hJkl
2     Qwerty
3    zxcvbNm
dtype: object
0       asDfg
1     hJkl
2    Qwerty
3     zxcvbNm
dtype: object
0       asDfg
1        hJkl
2      Qwerty
3     zxcvbNm
dtype: object

In [ ]:
#6
'''
std_name = input("Enter Student names :")
std_name.split()
father_name = input("Enter student's father names in order :")
father_name.split()
number = input("Enter mobile number :")
number.split()
ind = input("Enter roll numbers :")
ind = ind.split()
data = {
    'std_name' : std_name,
    'father_name' : father_name,
    'number' : number
       }
data = pd.DataFrame(data, index=ind)
'''

data = {
    'std_name' : ['std1', 'std2', 'std3', 'std4'],
    'father_name' : ['name1', 'name2', 'name3', 'name4'],
    'number' : [9876543210, 8765432109, 7654321098, 6543210987]
}
ind = [1000, 2000, 3000, 4000]

classes = pd.DataFrame(data, index=ind)
print(classes)

     std_name father_name      number
1000     std1       name1  9876543210
2000     std2       name2  8765432109
3000     std3       name3  7654321098
4000     std4       name4  6543210987

In [ ]:
#7
(data['std_name'])   #.to_string(index=False)

['std1', 'std2', 'std3', 'std4']

In [ ]:
#8
#classes['std_name'] = 'satya'
#classes['std_name'][1000]
classes=classes.replace('std1', 'satya')
classes

     std_name father_name      number
1000    satya       name1  9876543210
2000     std2       name2  8765432109
3000     std3       name3  7654321098
4000     std4       name4  6543210987

In [ ]:
#9
classes['grade']=[9,8,10,7]
classes

     std_name father_name      number  grade
1000    satya       name1  9876543210      9
2000    satya       name2  8765432109      8
3000    satya       name3  7654321098     10
4000    satya       name4  6543210987      7

In [ ]:
#10
dic = {
    'branch' : ['cse', 'ece', 'eee'],
    'section' : ['a', 'b', 'c'],
    'year' : [1, 2, 3]
}
df= pd.DataFrame(dic)
df

  branch section  year
0    cse       a     1
1    ece       b     2
2    eee       c     3